import Solution

###################################################################################
#                                                                                 #
# Условие:                                                                        #
#                                                                                 #
#                               Суммирование                                      #
# Напишите программу, которая находит суммирование каждого числа от 1 до num.     #
# Это число всегда будет положительным целым числом больше 0.                     #
#                                                                                 #
#                                                                                 #
# summation(2) -> 3                                                               #
#   1 + 2                                                                         #
#                                                                                 #
# summation(8) -> 36                                                              #
#   1 + 2 + 3 + 4 + 5 + 6 + 7 + 8                                                 #
#                                                                                 #
# Ответ:                                                                          #
#                                                                                 #
print(Solution.summation(8))                                                      #
#                                                                                 #
###################################################################################